In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.5.3'

In [3]:
list = [1,2,-3,6.2,"data values"]
print(list)

[1, 2, -3, 6.2, 'data values']

In [4]:
series = pd.Series([1,2,3,4,5],dtype = float, name = "data values")
print(series)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
Name: data values, dtype: float64

In [5]:
type(series)

pandas.core.series.Series

In [6]:
series1 = pd.Series(0.5, index = [1,2,3,4])
print(series1)

1    0.5
2    0.5
3    0.5
4    0.5
dtype: float64

In [7]:
series2 = pd.Series({"a":1, "b":2})
print(series2)

a    1
b    2
dtype: int64

In [8]:
series[0:3]

0    1.0
1    2.0
2    3.0
Name: data values, dtype: float64

In [9]:
max(series)

5.0

In [10]:
series[series>3]

3    4.0
4    5.0
Name: data values, dtype: float64

In [11]:
series

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
Name: data values, dtype: float64

In [13]:
series1 = pd.Series([6,7,8,9,10], dtype = int )
print(series1)

0     6
1     7
2     8
3     9
4    10
dtype: int32

In [14]:
series + series1

0     7.0
1     9.0
2    11.0
3    13.0
4    15.0
dtype: float64

In [15]:
naman = pd.DataFrame()
print(naman)

Empty DataFrame
Columns: []
Index: []

In [16]:
list = [1,2,3,4],[5,6,7,8],[9,10,11,12]
print(list)

([1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12])

In [17]:
naman = pd.DataFrame(list)
print(naman)

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [18]:
naman

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [19]:
dict = {"ID": [11,12,13,14],"SN":[1,2,3,4]}
dict

{'ID': [11, 12, 13, 14], 'SN': [1, 2, 3, 4]}

In [20]:
naman1 = pd.DataFrame(dict)
naman1

   ID  SN
0  11   1
1  12   2
2  13   3
3  14   4

In [21]:
dict1 = [{"a":1,"b":2},{"a":3,"b":4}]
pd.DataFrame(dict1)

   a  b
0  1  2
1  3  4

In [22]:
dict2 =  [{"a":1,"b":2},{"a":3,"b":4,"c":5}]
pd.DataFrame(dict2)

   a  b    c
0  1  2  NaN
1  3  4  5.0

In [26]:
j= pd.Series([1,2,3])
print(j)

0    1
1    2
2    3
dtype: int64

In [29]:
dict3 = {"a":pd.Series([1,2,3]),"SN":pd.Series([11,12,13])}
pd.DataFrame(dict3)

   a  SN
0  1  11
1  2  12
2  3  13